Godcomplexx/Keychain_motion/xiao_nrf52840/src/main.c
#include <math.h>
#include <stdbool.h>
#include <stdint.h>

#include <nrf.h>
#include <zephyr/devicetree.h>
#include <zephyr/drivers/gpio.h>
#include <zephyr/kernel.h>
#include <zephyr/random/random.h>
#include <zephyr/usb/usb_device.h>
#if defined(CONFIG_BOOTLOADER_MCUBOOT)
#include <zephyr/dfu/mcuboot.h>
#endif

#include "breakout_game.h"
#include "device_clock.h"
#include "draw_pad.h"
#include "esp_log.h"
#include "flip_animation.h"
#include "motion_detector.h"
#include "motion_state.h"
#include "mpu6050.h"
#include "mpu6050_optional.h"
#include "battery.h"
#include "i2c_scan.h"
#include "oled_display.h"
#include "oled_display_optional.h"
#include "pet_behavior.h"
#include "pet_face.h"
#include "phone_commands.h"
#include "phone_sync.h"
#include "time_animation.h"
#include "usb_dfu_touch.h"

#define ACTIVE_FRAME_DELAY_MS 25
#define GAME_FRAME_DELAY_MS 40
#define LOW_POWER_LOOP_DELAY_MS 50
#define STARTUP_SCREEN_DELAY_MS 1000
#define HARDWARE_RETRY_INTERVAL_US 5000000
#define BLE_ADVERTISING_RETRY_US 5000000
/*
 * How long the keychain keeps answering after it has gone to sleep.
 *
 * Advertising continuously is what makes the app's buttons work the moment
 * they are pressed, but it also means a thing carried in a pocket broadcasts
 * an unchanging address around the clock, which is a tracking beacon nobody
 * asked for. Staying reachable for a couple of minutes after being put down
 * keeps the buttons useful - you have just set it on the table - while a
 * keychain left alone goes quiet. Picking it up brings the radio straight
 * back.
 */
#define BLE_QUIET_AFTER_SLEEP_US 120000000
#define MICROSECONDS_PER_SECOND 1000000.0f
#define TIME_FRAME_INTERVAL_US 1000000
/* How long the clock stays up once asked for. */
#define TIME_STATE_DURATION_US 15000000
#define SLEEP_STILLNESS_TIMEOUT_US 30000000
#define MOTION_MOVEMENT_DELTA_THRESHOLD 80
/*
 * Measured on real hands rather than guessed. A single tap on the case reaches
 * 240 to 528 counts between samples; rocking it gently tops out around 204;
 * resting on a desk is 1 to 3. The old 350 sat inside the range a tap produces,
 * so roughly half of them registered and the rest did nothing, which is what
 * made a jolt feel unreliable. 250 clears rocking and catches the weak taps.
 */
#define MOTION_SHAKE_DELTA_THRESHOLD 250
#define MOTION_SHAKE_COUNT_REQUIRED 3
#define MOTION_SHAKE_WINDOW_US 2500000
#define PHONE_SYNC_SHUTDOWN_GRACE_MS 200
/*
 * Drawing ends by itself if the phone stops sending. Long enough that thinking
 * about what to draw does not close the pad, short enough that a phone which
 * crashed does not leave the screen stuck on someone's picture.
 */
#define DRAW_IDLE_TIMEOUT_US 300000000
#define OLED_ACTIVE_CONTRAST 0x9F
#define OLED_GAME_CONTRAST 0x8F
#define OLED_IDLE_CONTRAST 0x18
#define RAW_LOG_INTERVAL_FRAMES 200
/*
 * How often the resting screen is redrawn.
 *
 * This used to be a flat 200 ms, chosen when the resting screen was a dim idle
 * animation. It is now the companion's face, and five frames a second destroys
 * everything that makes it look alive: an eased gaze settles between frames, a
 * glance lasting 600 ms is three of them. Only a pet that is actually asleep
 * gets the slow rate now - there is nothing to see there anyway.
 */
#define PET_AWAKE_FRAME_INTERVAL_US 40000
#define PET_ASLEEP_FRAME_INTERVAL_US 200000
/* A cell voltage moves slowly; sampling it often would only waste current. */
#define BATTERY_SAMPLE_INTERVAL_US 10000000
/* Tilt gestures need hysteresis, otherwise every frame near the edge fires. */
#define TILT_TRIGGER_G 0.35f
#define TILT_RELEASE_G 0.18f
/* Below this the keychain counts as level and the gaze rests in the middle. */
#define TILT_DEAD_ZONE_G 0.06f
/*
 * Set to 1 to bring the particle game back. Switched off for now so the face
 * can be judged on its own: FLIP takes over the whole display for 30 seconds
 * at a time, which makes everything else hard to watch. Nothing else can start
 * it - the activity scheduler never picks it - so this one switch is enough.
 */
#define PLAY_GESTURE_ENABLED 0

/*
 * Tip it steeply and hold, like tipping a glass, and the particles come out.
 * Steep enough and long enough that ordinary handling cannot do it by accident.
 */
/*
 * 0.70 g is about 44 degrees from flat. Steeper than that is awkward while the
 * board still has a display and a USB cable hanging off it, and the keychain
 * already rests near 0.38 g, so this is a clear deliberate tip either way.
 */
#define PLAY_GESTURE_TILT_G 0.70f
#define PLAY_GESTURE_HOLD_US 1500000

/*
 * In free fall the accelerometer stops feeling gravity, so the magnitude of
 * the vector collapses towards zero. Nothing else on a desk does that.
 */
#define FREE_FALL_MAGNITUDE_G 0.35f
#define FREE_FALL_HOLD_US 80000
#define FREE_FALL_REARM_US 1500000

/*
 * Gravity pointing the wrong way along Z, held long enough to be deliberate.
 *
 * Which Z sign means inverted is not derivable. Not from the layout - U5 shares
 * the top layer with everything else - and not from a reading either, because a
 * reading says where the board is, not which way it is meant to be. Samples
 * taken minutes apart showed -0.88 g and +0.91 g, both at rest, and picking a
 * sign by hand got it wrong twice.
 *
 * So the firmware stops guessing and learns instead: whichever way up the
 * keychain is when it starts is "upright", and the opposite is inverted. That
 * makes the rule something a person can state without ambiguity, and a power
 * cycle in the normal position is the whole recalibration procedure.
 */
#define UPSIDE_DOWN_G 0.55f
#define UPSIDE_DOWN_HOLD_US 600000
/* Ignore near-vertical startups, where Z carries no orientation information. */
#define UPRIGHT_REFERENCE_MIN_G 0.40f
/*
 * Learning only at startup is not enough: the board reboots on every firmware
 * update, in whatever position it happened to be lying, and a wrong reference
 * then sticks until someone power-cycles it deliberately.
 *
 * So it also re-learns from a long motionless rest. Whatever the keychain has
 * been lying in, untouched, for a solid minute is what normal looks like -
 * nobody holds one inverted and perfectly still for that long, so the reaction
 * survives while a reference learned at a bad moment heals itself.
 */
#define UPRIGHT_RELEARN_STILL_US 25000000

