Godcomplexx/Keychain_motion/xiao_nrf52840/src/main.c
/*
 * Rocking is slow, gentle and repetitive: several direction changes inside a
 * few seconds, with an amplitude between "not still" and "being shaken".
 */
#define ROCKING_MIN_TILT_G 0.12f
#define ROCKING_MAX_TILT_G 0.70f
/*
 * Six reversals is three full there-and-back cycles. Fewer than that and a
 * couple of deliberate tilts counted as rocking, so tilting left and right
 * stopped producing glances and went straight to the soothed face.
 */
#define ROCKING_REVERSALS_REQUIRED 6
/*
 * And they have to arrive in rhythm. Rocking is continuous; a deliberate tilt
 * dwells at the extreme and comes back when it is ready. Requiring each
 * reversal within a second and a half of the last is what separates the two.
 */
#define ROCKING_WINDOW_US 1500000
/*
 * Once rocking is recognised it stays recognised for this long, and every
 * further reversal extends it. Resetting the count on a fixed window made the
 * soothed face drop out and come back every few seconds, which read as the
 * state flickering rather than as the pet being calmed.
 */
#define ROCKING_HOLD_US 3000000

/*
 * Something moved nearby without picking the keychain up: a tremor above the
 * noise floor but below the threshold that counts as handling.
 */
#define NEARBY_MOTION_MIN_DELTA 18
#define NEARBY_MOTION_MAX_DELTA 70
#define NEARBY_MOTION_REARM_US 12000000

/*
 * Set to 1 to print a motion summary once a second.
 *
 * The thresholds for a jolt, a shake and rocking were all picked by reasoning
 * about what the numbers ought to be, and all three turned out wrong on real
 * hands. This reports the extremes actually reached, which is what the
 * thresholds should have been derived from in the first place.
 */
#define MOTION_DEBUG 1
#define MOTION_DEBUG_INTERVAL_US 1000000
/*
 * Testing on a cable is awkward - you cannot really drop a keychain that is
 * tethered to a laptop. So the same summaries are also kept in RAM, which
 * survives on battery, and the whole lot is printed when USB comes back. Only
 * seconds where something happened are stored, so this covers a long session.
 */
#define MOTION_HISTORY_LEN 96
#define MOTION_HISTORY_MIN_DELTA 30

static const char *TAG = "keychain";

#if MOTION_DEBUG
/* One second of motion, kept so it can be read back after a cable-free test. */
typedef struct {
    uint32_t at_ms;
    int16_t max_delta;
    int16_t min_g_centi;
    int16_t max_g_centi;
    int16_t min_side_centi;
    int16_t max_side_centi;
    uint8_t peaks;
    uint8_t reversals;
    uint8_t behaviour;
} motion_record_t;

static motion_record_t s_motion_history[MOTION_HISTORY_LEN];
static uint8_t s_motion_history_count;
static uint8_t s_motion_history_next;

static void motion_history_add(const motion_record_t *record)
{
    s_motion_history[s_motion_history_next] = *record;
    s_motion_history_next =
        (uint8_t)((s_motion_history_next + 1U) % MOTION_HISTORY_LEN);
    if (s_motion_history_count < MOTION_HISTORY_LEN) {
        ++s_motion_history_count;
    }
}

/* Print oldest first, then forget: the next session starts clean. */
static void motion_history_dump(void)
{
    if (s_motion_history_count == 0U) {
        return;
    }

    ESP_LOGI("motion", "--- %u recorded second(s) while off the cable ---",
             (unsigned)s_motion_history_count);
    const uint8_t first = (uint8_t)((s_motion_history_next +
                                     MOTION_HISTORY_LEN -
                                     s_motion_history_count) %
                                    MOTION_HISTORY_LEN);
    for (uint8_t index = 0U; index < s_motion_history_count; ++index) {
        const motion_record_t *record =
            &s_motion_history[(first + index) % MOTION_HISTORY_LEN];
        ESP_LOGI("motion",
                 "t=%u.%03us delta=%d | g %d.%02d..%d.%02d | side %d..%d"
                 " | peaks=%u rev=%u | %s",
                 (unsigned)(record->at_ms / 1000U),
                 (unsigned)(record->at_ms % 1000U),
                 record->max_delta,
                 record->min_g_centi / 100, record->min_g_centi % 100,
                 record->max_g_centi / 100, record->max_g_centi % 100,
                 record->min_side_centi, record->max_side_centi,
                 (unsigned)record->peaks, (unsigned)record->reversals,
                 pet_behavior_name((pet_behavior_id_t)record->behaviour));
    }
    s_motion_history_count = 0U;
    s_motion_history_next = 0U;
}
#endif

/*
 * On this PCB the USB 5 V rail feeds both the charger (U1) and the module VBUS
 * pin, so "VBUS is present" is the same fact as "the charger is plugged in".
 *
 * This reads the SoC's own VBUS detector instead of listening to USB device
 * stack callbacks. The E73 image enumerates no USB class at all - the
 * nrf52840dk devicetree has no cdc-acm node, so CONFIG_USB_CDC_ACM is dropped -
 * and would therefore never receive a single callback. The POWER peripheral
 * answers regardless, and a dumb charger that never enumerates still raises
 * VBUS, which a USB callback could not have reported either.
 */
static bool charger_is_attached(void)
{
    return (NRF_POWER->USBREGSTATUS & POWER_USBREGSTATUS_VBUSDETECT_Msk) != 0U;
}

#if DT_NODE_EXISTS(DT_NODELABEL(accel_int))

/*
 * ACC_INT1 reaches U4 pin 22 = P0.07, and the LIS2DW12 pulses it on wake-up.
 * The devicetree pulls the line down, so an unsoldered sensor cannot produce
 * phantom edges. This is the path that will let the SoC sleep and be woken by
 * movement instead of polling the sensor.
 */
static const struct gpio_dt_spec s_accel_int =
    GPIO_DT_SPEC_GET(DT_NODELABEL(accel_int), gpios);
static struct gpio_callback s_accel_int_callback;
static volatile bool s_accel_int_fired;

static void accel_int_handler(const struct device *port,
                              struct gpio_callback *callback,
                              gpio_port_pins_t pins)
{
    ARG_UNUSED(port);
    ARG_UNUSED(callback);
    ARG_UNUSED(pins);
    s_accel_int_fired = true;
}

static void accel_int_init(void)
{
    if (!gpio_is_ready_dt(&s_accel_int) ||
        gpio_pin_configure_dt(&s_accel_int, GPIO_INPUT) != 0 ||
        gpio_pin_interrupt_configure_dt(&s_accel_int,
                                        GPIO_INT_EDGE_TO_ACTIVE) != 0) {
        ESP_LOGW(TAG, "ACC_INT1 could not be armed");
        return;
    }
    gpio_init_callback(&s_accel_int_callback, accel_int_handler,
                       BIT(s_accel_int.pin));
    (void)gpio_add_callback(s_accel_int.port, &s_accel_int_callback);
    ESP_LOGI(TAG, "ACC_INT1 armed on P0.%02u", s_accel_int.pin);
}

/* Consume a pending edge, if any. */
static bool accel_int_take(void)
{
    if (!s_accel_int_fired) {
        return false;
    }
    s_accel_int_fired = false;
    return true;
}

#else

static void accel_int_init(void)
{
    /* No ACC_INT1 line in this build. */
}

static bool accel_int_take(void)
{
    return false;
}

#endif

