Godcomplexx/Keychain_motion/xiao_nrf52840/src/main.c
/*
 * Turn a tilt in g into the -100..100 the face follows.
 *
 * A small dead zone keeps a keychain lying flat from twitching, and the caller
 * smooths the result so the eyes glide instead of chattering at 40 frames per
 * second.
 */
static int8_t tilt_to_percent(float tilt)
{
    const float magnitude = (tilt < 0.0f) ? -tilt : tilt;
    if (magnitude < TILT_DEAD_ZONE_G) {
        return 0;
    }

    int value = (int)(tilt * 100.0f);
    if (value > 100) { value = 100; }
    if (value < -100) { value = -100; }
    return (int8_t)value;
}

/*
 * Convert a raw tilt reading into -1, 0 or +1 with hysteresis: the gesture only
 * re-arms after the keychain returns close to level.
 */
static int tilt_zone(float tilt_x, int previous_zone)
{
    const float magnitude = (tilt_x < 0.0f) ? -tilt_x : tilt_x;
    if (previous_zone != 0 && magnitude < TILT_RELEASE_G) {
        return 0;
    }
    if (tilt_x <= -TILT_TRIGGER_G) {
        return -1;
    }
    if (tilt_x >= TILT_TRIGGER_G) {
        return 1;
    }
    return previous_zone;
}

static int64_t uptime_us(void)
{
    return k_ticks_to_us_floor64(k_uptime_ticks());
}

/*
 * The resting screen is the same companion face, only redrawn a few times per
 * second. The pet decides what it looks like there: bored, asleep or busy with
 * one of its own activities.
 */
static esp_err_t render_pet_sleep_frame_if_due(int64_t now_us,
                                               int64_t *previous_frame_us,
                                               const pet_view_t *view,
                                               float tilt_x, float tilt_y,
                                               float frame_seconds)
{
    if (!oled_display_is_available()) {
        return ESP_OK;
    }

    /* Particles need every frame to look like a fluid; a face does not. */
    if (view->id == PET_ACT_FLUID) {
        *previous_frame_us = now_us;
        return flip_animation_render(tilt_x, tilt_y, frame_seconds);
    }

    /* The pet's own state decides the rate, not the legacy screen mode. */
    const int64_t interval = (view->id == PET_ASLEEP)
        ? PET_ASLEEP_FRAME_INTERVAL_US : PET_AWAKE_FRAME_INTERVAL_US;
    if (now_us - *previous_frame_us < interval) {
        return ESP_OK;
    }
    const esp_err_t err = pet_face_render(view, (uint32_t)(now_us / 1000));
    if (err == ESP_OK) {
        *previous_frame_us = now_us;
    }
    return err;
}

static esp_err_t render_time_frame_if_due(int64_t now_us,
                                          int64_t entered_at_us,
                                          int64_t *previous_frame_us,
                                          const device_clock_t *clock)
{
    if (!oled_display_is_available() ||
        now_us - *previous_frame_us < TIME_FRAME_INTERVAL_US) {
        return ESP_OK;
    }

    device_clock_datetime_t datetime;
    device_clock_get_datetime(clock, now_us, &datetime);
    const time_animation_view_t view = {
        .year = datetime.year,
        .month = datetime.month,
        .day = datetime.day,
        .hour = datetime.hour,
        .minute = datetime.minute,
        .second = datetime.second,
        .clock_synced = device_clock_has_phone_sync(clock),
    };
    const esp_err_t err = time_animation_render(
        &view, now_us - entered_at_us, TIME_STATE_DURATION_US);
    if (err == ESP_OK) {
        *previous_frame_us = now_us;
    }
    return err;
}

static void apply_state_entry_actions(motion_state_t state,
                                      int64_t now_us,
                                      int64_t *previous_frame_us,
                                      int64_t *previous_sleep_frame_us,
                                      int64_t *previous_time_frame_us)
{
    /* A missing OLED is not fatal: BLE and sensor probing keep running. */
    if (!oled_display_is_available()) {
        ESP_LOGI(TAG, "Entered %s state (OLED absent)",
                 motion_state_name(state));
        return;
    }

    (void)oled_display_set_power(true);
    switch (state) {
    case MOTION_STATE_FLUID:
        (void)oled_display_set_contrast(OLED_ACTIVE_CONTRAST);
        flip_animation_reset();
        *previous_frame_us = now_us;
        break;
    case MOTION_STATE_SLEEP:
        (void)oled_display_set_contrast(OLED_IDLE_CONTRAST);
        *previous_sleep_frame_us = 0;
        break;
    case MOTION_STATE_TIME:
        (void)oled_display_set_contrast(OLED_ACTIVE_CONTRAST);
        *previous_time_frame_us = 0;
        break;
    case MOTION_STATE_GAME:
        (void)oled_display_set_contrast(OLED_GAME_CONTRAST);
        *previous_frame_us = now_us;
        break;
    case MOTION_STATE_DRAW:
        (void)oled_display_set_contrast(OLED_ACTIVE_CONTRAST);
        break;
    default:
        break;
    }
    ESP_LOGI(TAG, "Entered %s state", motion_state_name(state));
}

static motion_event_t detector_result_to_event(
    const motion_detector_result_t *result)
{
    if (result->shake_detected) return MOTION_EVENT_SHAKE_DETECTED;
    if (result->movement_detected) return MOTION_EVENT_MOVEMENT_DETECTED;
    if (result->stillness_timeout) return MOTION_EVENT_STILLNESS_TIMEOUT;
    return MOTION_EVENT_NONE;
}

static void log_render_error(const char *screen, esp_err_t err)
{
    if (err != ESP_OK) {
        ESP_LOGW(TAG, "%s render deferred; OLED will be reprobed: %s",
                 screen, esp_err_to_name(err));
    }
}

int main(void)
{
    /* USB is useful on XIAO but optional on the battery-powered final PCB. */
    (void)usb_enable(NULL);
    ESP_LOGI(TAG, "Smart Motion Keychain nRF52840 port started");
    /*
     * Three images exist for two boards. Saying which one is running turns a
     * confusing log into an obvious one - especially "why does USB update not
     * work", whose answer is usually that this is the bare image.
     */
#if defined(CONFIG_BOOTLOADER_MCUBOOT)
    ESP_LOGI(TAG, "Build: MCUboot slot0 image; USB update available");
#else
    ESP_LOGI(TAG, "Build: bare image at flash origin; SWD update only");
#endif

