Godcomplexx/Keychain_motion/xiao_nrf52840/src/main.c
        /*
         * The phone is the one that starts things now: a button press shows the
         * clock or opens the game. That only works if the keychain can be
         * reached at the moment the button is pressed, so it advertises
         * whenever it is awake and not playing. The shake gesture used to be
         * the only way in, which meant every button press had to be preceded
         * by shaking the keychain awake.
         */
        const bool radio_wanted =
            current_state != MOTION_STATE_GAME &&
            (current_state != MOTION_STATE_SLEEP ||
             now_us - motion_state_entered_at_us(&state_machine) <
                 BLE_QUIET_AFTER_SLEEP_US);

        if (phone_sync_available && radio_wanted &&
            now_us - last_ble_request_us >= BLE_ADVERTISING_RETRY_US) {
            last_ble_request_us = now_us;
            if (phone_sync_request_advertising() == ESP_OK &&
                !ble_advertising_announced) {
                /*
                 * Advertising is retried every few seconds here, so the pet is
                 * told only once: otherwise it would restart the looking-for-
                 * the-phone animation forever and never show anything else.
                 */
                ble_advertising_announced = true;
                pet_behavior_post(&pet, PET_EVENT_PHONE_WINDOW_OPEN, now_ms);
            }
        } else if (phone_sync_available && !radio_wanted &&
                   ble_advertising_announced) {
            phone_sync_stop_advertising();
            ble_advertising_announced = false;
            pet_behavior_post(&pet, PET_EVENT_PHONE_WINDOW_CLOSED, now_ms);
            ESP_LOGI(TAG, "Radio quiet: %s",
                     current_state == MOTION_STATE_GAME ? "playing"
                                                        : "asleep");
        }

        if (phone_sync_available && phone_sync_take_connected_event()) {
            pet_behavior_post(&pet, PET_EVENT_PHONE_CONNECTED, now_ms);
        }

        phone_sync_command_t command;
        if (phone_sync_available && phone_sync_get_command(&command)) {
            const motion_state_t previous_state = current_state;

            const phone_command_plan_t plan = phone_command_plan(command);

            if (plan.shutdown_radio) {
                ble_advertising_announced = false;
                phone_sync_stop_advertising();
                k_sleep(K_MSEC(PHONE_SYNC_SHUTDOWN_GRACE_MS));
                (void)phone_sync_shutdown();
            }
            if (plan.reset_canvas) {
                draw_pad_clear(&pad);
                last_draw_packet_us = now_us;
            }
            if (plan.event != MOTION_EVENT_NONE) {
                current_state = motion_state_handle_event(
                    &state_machine, plan.event, true, now_us);
                ESP_LOGW(TAG, "Phone command: %s",
                         motion_event_name(plan.event));
            }
            if (plan.start_game) {
                breakout_game_start(&game, now_us, sys_rand32_get(),
                                    last_tilt_side);
            }

            if (current_state != previous_state) {
                apply_state_entry_actions(current_state, now_us,
                                          &previous_frame_us,
                                          &previous_sleep_frame_us,
                                          &previous_time_frame_us);
            } else if (current_state == MOTION_STATE_TIME) {
                previous_time_frame_us = 0;
            }
        }

        if (current_state == MOTION_STATE_DRAW) {
            phone_sync_draw_packet_t packet;
            while (phone_sync_get_draw_packet(&packet)) {
                (void)draw_pad_apply_packet(&pad, packet.data, packet.length);
                last_draw_packet_us = now_us;
            }

            /*
             * Two ways out that do not involve the phone asking: it hung up, or
             * it stopped talking. Without these the screen would stay on
             * someone's drawing until the battery ran out.
             */
            const bool phone_gone = !phone_sync_is_connected();
            const bool gone_quiet =
                now_us - last_draw_packet_us >= DRAW_IDLE_TIMEOUT_US;
            if (phone_gone || gone_quiet) {
                current_state = motion_state_handle_event(
                    &state_machine, MOTION_EVENT_DRAW_FINISHED, true, now_us);
                apply_state_entry_actions(current_state, now_us,
                                          &previous_frame_us,
                                          &previous_sleep_frame_us,
                                          &previous_time_frame_us);
                ESP_LOGW(TAG, "Draw pad closed: %s",
                         phone_gone ? "phone disconnected" : "no packets");
            }
        }

        device_clock_datetime_t phone_datetime;
        if (phone_sync_available &&
            phone_sync_get_datetime_update(&phone_datetime)) {
            /*
             * Setting the clock no longer takes the screen. A background sync
             * should correct the time and leave the companion alone; the clock
             * appears when someone asks for it, which is TIME:SHOW. The radio
             * also stays up, because the phone is connected and the next
             * button press has to have somewhere to arrive.
             */
            device_clock_set_datetime(&clock, &phone_datetime, now_us);
            pet_behavior_post(&pet, PET_EVENT_PHONE_SYNCED, now_ms);
            ESP_LOGW(TAG, "Clock synchronized from phone");
        }

        if (current_state == MOTION_STATE_TIME &&
            now_us - motion_state_entered_at_us(&state_machine) >=
                TIME_STATE_DURATION_US) {
            const bool movement_recent = !mpu6050_is_available() ||
                motion_detector_has_recent_movement(&detector, now_us);
            (void)motion_state_handle_event(&state_machine,
                                            MOTION_EVENT_TIME_TIMEOUT,
                                            movement_recent, now_us);
            current_state = motion_state_get(&state_machine);
            apply_state_entry_actions(current_state, now_us,
                                      &previous_frame_us,
                                      &previous_sleep_frame_us,
                                      &previous_time_frame_us);
        }

