Godcomplexx/Keychain_motion/xiao_nrf52840/src/main.c
            /*
             * No reference is learned at startup any more. The board reboots
             * on every firmware update, usually in someone's hand, and a
             * reference caught there is wrong - which is how the pet ended up
             * insisting it was upside down while lying on a desk. Until a
             * still rest establishes one, the state simply does not fire.
             *
             * A long undisturbed rest is the reference.
             */
            if (detector_result.stillness_us >= UPRIGHT_RELEARN_STILL_US &&
                (tilt_z >= UPRIGHT_REFERENCE_MIN_G ||
                 tilt_z <= -UPRIGHT_REFERENCE_MIN_G)) {
                const int resting_sign = (tilt_z > 0.0f) ? 1 : -1;
                if (resting_sign != upright_z_sign) {
                    upright_z_sign = resting_sign;
                    upside_down = false;
                    upside_down_started_us = 0;
                    ESP_LOGI(TAG,
                             "Upright reference relearned after a still minute:"
                             " Z = %.2f g", (double)tilt_z);
                }
            }

            /* Held inverted relative to that, long enough to be deliberate. */
            if (upright_z_sign != 0 &&
                (float)upright_z_sign * tilt_z <= -UPSIDE_DOWN_G) {
                if (upside_down_started_us == 0) {
                    upside_down_started_us = now_us;
                } else if (now_us - upside_down_started_us >=
                           UPSIDE_DOWN_HOLD_US) {
                    if (!upside_down) {
                        ESP_LOGI(TAG, "Upside down (Z = %.2f g)",
                                 (double)tilt_z);
                    }
                    upside_down = true;
                }
            } else {
                upside_down_started_us = 0;
                upside_down = false;
            }

            /*
             * Rocking: count direction reversals of a gentle tilt. A shake
             * reverses too, but its amplitude is far outside this band.
             */
            const float swing = (tilt_side < 0.0f) ? -tilt_side : tilt_side;
            if (swing >= ROCKING_MIN_TILT_G && swing <= ROCKING_MAX_TILT_G) {
                const int direction = (tilt_side > 0.0f) ? 1 : -1;
                if (rocking_direction != 0 && direction != rocking_direction) {
                    ++rocking_reversals;
                    rocking_window_started_us = now_us;
                    if (rocking_reversals >= ROCKING_REVERSALS_REQUIRED) {
                        rocking_hold_until_us = now_us + ROCKING_HOLD_US;
                    }
                }
                rocking_direction = direction;
            }
            /* Forget the count only after the rocking has actually stopped. */
            if (rocking_window_started_us != 0 &&
                now_us - rocking_window_started_us > ROCKING_WINDOW_US) {
                rocking_window_started_us = 0;
                rocking_reversals = 0;
            }
            being_rocked = now_us < rocking_hold_until_us;

#if MOTION_DEBUG
            /*
             * Track the extremes rather than instantaneous values: a shake is
             * over in a few frames, and a once-a-second average would hide
             * exactly the peaks the thresholds are supposed to catch.
             */
            if (detector_result.raw_delta > debug_max_delta) {
                debug_max_delta = detector_result.raw_delta;
            }
            if (detector_result.shake_peak) {
                ++debug_peaks;
            }
            if (magnitude < debug_min_magnitude) {
                debug_min_magnitude = magnitude;
            }
            if (magnitude > debug_max_magnitude) {
                debug_max_magnitude = magnitude;
            }
            if (tilt_side < debug_min_side) { debug_min_side = tilt_side; }
            if (tilt_side > debug_max_side) { debug_max_side = tilt_side; }

            if (now_us - motion_debug_window_us >= MOTION_DEBUG_INTERVAL_US) {
                motion_debug_window_us = now_us;

                /* Keep the seconds worth keeping, for reading back later. */
                if (debug_max_delta >= MOTION_HISTORY_MIN_DELTA ||
                    debug_peaks > 0 || rocking_reversals > 0) {
                    const motion_record_t record = {
                        .at_ms = now_ms,
                        .max_delta = (int16_t)debug_max_delta,
                        .min_g_centi = (int16_t)(debug_min_magnitude * 100.0f),
                        .max_g_centi = (int16_t)(debug_max_magnitude * 100.0f),
                        .min_side_centi = (int16_t)(debug_min_side * 100.0f),
                        .max_side_centi = (int16_t)(debug_max_side * 100.0f),
                        .peaks = (uint8_t)debug_peaks,
                        .reversals = (uint8_t)rocking_reversals,
                        .behaviour = (uint8_t)pet_behavior_view(&pet)->id,
                    };
                    motion_history_add(&record);
                }

                ESP_LOGI("motion",
                         "delta max=%d | g %.2f..%.2f | side %+.2f..%+.2f"
                         " | peaks=%d rev=%d",
                         debug_max_delta,
                         (double)debug_min_magnitude,
                         (double)debug_max_magnitude,
                         (double)debug_min_side, (double)debug_max_side,
                         debug_peaks, rocking_reversals);
                debug_max_delta = 0;
                debug_peaks = 0;
                debug_min_magnitude = 9.0f;
                debug_max_magnitude = 0.0f;
                debug_min_side = 9.0f;
                debug_max_side = -9.0f;
            }
#endif

            /* A tremor through the surface, with nobody holding it. */
            const int delta = detector_result.raw_delta;
            if (delta >= NEARBY_MOTION_MIN_DELTA &&
                delta <= NEARBY_MOTION_MAX_DELTA && !being_rocked &&
                now_us - last_nearby_motion_us >= NEARBY_MOTION_REARM_US) {
                last_nearby_motion_us = now_us;
                pet_behavior_post(&pet, PET_EVENT_NEARBY_MOTION, now_ms);
            }
        } else {
            upside_down = false;
            being_rocked = false;
        }

